VanHungLe0611/Camera_Modul_with_STM32L496ZG/Src/user_main.cpp
#include "user_main.h"
#include "ov2640_dcmi_drv.h"
#include "dwt_stm32_delay.h"
#include "stm32l4xx_hal.h"

void user_code1() {
}

void user_code2() {

	//  BSP_CAMERA_Init(IMAGE_RESOLUTION)
	// init camera
	ov2640_dcmi_drv &cam_driver = ov2640_dcmi_drv::instance();
	int i = 0;

	/* GPIOC & PIN 2 to measure execution time of CAMERA_Init function*/
	//	GPIOC->BSRR |= GPIO_BSRR_BS_2; // GPIO_OUT_PUT = HIGH
	Camera_StatusTypeDef cam_status = cam_driver.CAMERA_Init(IMAGE_RESOLUTION);
	//	GPIOC->BSRR |= GPIO_BSRR_BR_2; // GPIO_OUT_PUT = LOW

	while (i < 5)
		switch (cam_status) {
		case CAMERA_OK:
			//  BSP_CAMERA_SnapshotStart(image_data);
			cam_driver.CAMERA_Resume();
			cam_driver.CAMERA_SnapshotStart(CAMERA_BUFFER_INTERN);
			cam_driver.CAMERA_Stop();

			while (!uart_complete) {
			}
			uart_complete = 0;
			i++;

			break;
		case CAMERA_TIMEOUT:
			SEGGER_RTT_printf(0, "%s\n", "CAMERA_TIME_OUT");
			break;
		case CAMERA_ERROR:
			SEGGER_RTT_printf(0, "%s\n", "CAMERA_ERROR");
			break;
		}

}

// user code, which is used for Testing
void user_code3() {

	uint32_t count = 0;
	while (1) {


		HAL_GPIO_WritePin(GPIOG, GPIO_PIN_12, GPIO_PIN_RESET);

		/* Function is measured here */
		// delayUS(1680);
		//HAL_Delay(1);
		DWT_Delay_us(1680);
		HAL_GPIO_WritePin(GPIOG, GPIO_PIN_12, GPIO_PIN_SET);
	}
}

void HAL_TIM_PeriodElapsedCallback(){

}

void loop() {
	HAL_Delay(1000);
}
